use my_mall;


/* *************************************
SQL: 대소문자 구분 안함. (값은 구분)

SELECT 기본 구문 - 연산자, 컬럼 별칭
select 컬럼명, 컬럼명 [, .....]  => 조회할 컬럼 지정. *: 모든 컬럼
from   테이블명                 => 조회할 테이블 지정.

컬럼명 [as 별칭] => 테이블에서 컬럼명의 값들을 조회한 뒤 그 결과를 별칭으로 지정한 컬럼반환한다. 별칭에 컬럼명으로 못 사용하는 문자(공백,특수문자들)를 쓸 경우 " "로 감싼다. 
distinct 컬럼명 => 중복된 결과를 제거한다.

*************************************** */

-- CUSTOMER 테이블의 모든 컬럼의 모든 항목을 조회.


-- 성별의 범주값을 확인하시오.


-- 직업의 범주값을 확인하시오.


-- customer_id는 고객 ID, customer_name은 고객 이름, phone는 전화번호로 결과를 조회하시오.



/* **************************************
연산자 
- 산술 연산자 
	- +, -, *, /, %, mod, div (몫 연산)
- 여러개 값을 합쳐 문자열로 반환
	- concat(값, 값, ...)
- 피연산자가 null인 경우 결과는 null
- 연산은 그 컬럼의 모든 값들에 일률적으로 적용된다.
- 같은 컬럼을 여러번 조회할 수 있다.
************************************** */

-- 모든 고객의 이름(customer_name)과 총 결제금액(total_spent)의 10% 값을 조회하시오.


-- 모든 고객의 이름(customer_name)과 포인트(reward_point)를 2배로 만든 값 "리워드 이벤트"라는 이름으로 조회하시오.



-- 총 결제금액(total_spent)의 5%를 계산하여 Cashback이라는 이름으로 조회하시오.



/* *************************************
where 절을 이용한 행 선택 

주의 : mysql은 비교시 대소문자를 가리지 않는다.
      ex) where grade = 'VIP' -> 'vip', 'VIP', 'Vip' 모두 조회된다.
     대소문자 구별해서 비교하게 하려면 컬럼명 앞에 BINARY를 붙인다.
	  ex)  where binary grade = 'VIP'
************************************* */

-- 여성 고객들을(gender) 조회


-- 회원 등급(grade) 이 'VIP'인 고객의 이름(customer_name)과 이메일(email)을 조회하시오.


-- 회원 등급이 'VIP'가 아닌 고객을 조회하시오.


-- 직업(job)이 'Actor'인 고객의 이름(customer_name), 직업(job), 총 결제금액(total_spent)을 조회하시오.


-- 직업(job)이 'Student'가 아닌 고객의 이름(customer_name)과 직업(job)을 조회하시오


-- 활성 계정(is_active = TRUE)인 고객만 조회하시오.


-- 적립 포인트(reward_point)가 0인 고객의 이름과 포인트를 조회하시오.


-- 총 결제금액(total_spent)이 0인 고객을 조회하시오.


-- 총 결제금액(total_spent)이 1,000,000 이상인 고객의 이름(customer_name)과 총 결제금액(total_spent)을 조회하시오.



-- 적립 포인트(reward_point)가 5000 이상인 고객을 조회하시오.


-- 최근 로그인 일시(last_login)가 '2026-03-20 00:00:00' 이후인 고객을 조회하시오.


-- 적립 포인트(reward_point)가 1000 이하 10000 이상인 고객의 이름(customer_name)과 적립 포인트(reward_point)를 조회하시오.


-- 총 결제금액(total_spent)이 500000 이상 2000000 이하인 고객정보를 조회하시오.

-- 생년월일(birth_date)이 '1990-01-01' 부터 '1999-12-31' 사이인 고객정보를 조회하시오.


-- 가입일시(created_at)가 '2023-01-01'부터 '2023-12-31' 사이인 고객정보를 조회하시오.


-- 회원 등급(grade)이 'Gold' 또는 'VIP'인 고객을 조회하시오.


-- 직업(job)이 'Actor', 'Singer', 'Athlete' 이 아닌 고객을 조회하시오 


-- 김씨 성을(customer_name)의 고객을 조회하시오.


-- 이름(customer_name)에 '지'가 들어가는 고객을 조회하시오.


-- 이메일(email) 도메인이 gmail.com인 고객을 조회하시오. 


-- 이메일(email)이 15글자이고 도메인이 gmail.com인 고객을 조회하시오.


-- 직업(job)이 입력되지 않은 고객을 조회하시오


-- 최근 로그인 일시(last_login)가 있는/없는 고객을 조회하시오.


-- 추천인(recommender_id)이 있는 있는/없는 고객을 조회하시오.


/* ******************************************
 WHERE 조건이 여러개인 경우 AND 나 OR 로 조건들을 묶어준다.
 
 AND: 두 조건이 모두 True인 행만 조회
 OR: 두 조건 중 하나이상이 True인 행을 조회
 
 연산 우선순위: AND > OR
 	where 조건1 and 조건2 or 조건3
	  1. 조건 1 and 조건2
	  2. 1결과 or 조건3
 
 or를 먼저 하려면 where 조건1 and (조건2 or 조건3)
 *******************************************/

-- 여성(gender)이면서 VIP 등급(grade)인 고객을 조회하시오.


-- 직업(job)이 'Actor'이고 총 결제금액(total_spent)이 2000000 이상인 고객을 조회하시오.


-- 활성 계정(is_active)이면서 적립 포인트(reward_point)가 5000 이상인 고객을 조회하시오.


-- 1990년생(birth_date) 남성(gender) 중 VIP(grade) 고객을 조회하시오.


-- 총 결제금액(total_spent)이 5,000,000 이상이거나 적립 포인트(reward_point)가 200,000 이상인 고객을 조회하시오.


-- 회원 등급(grade)이 'Gold' 또는 'VIP'이면서, 총 결제금액(total_spent)이 2,000,000 이상인 고객을 조회하시오.


-- 성별(gender)이 'F'이고, 직업(job)이 'Singer' 또는 'Athlete'인 고객을 조회하시오.


-- 직업(job)이 NULL이 아니고, 총 결제금액(total_spent)이 500000 이상인 고객을 조회하시오.



/* *******************************************************************
order by를 이용한 정렬
- order by절은 select문의 마지막 구문으로 온다.
- order by 정렬기준컬럼 정렬방식 [, ...]
    - 정렬기준컬럼 지정 단위: 컬럼이름, 컬럼의순번(select절의 선언 순서)
     `select salary, hire_date from emp` 에서 salary 컬럼을 기준으로 정렬할 경우 `order by salary` 또는 `order by 1` 로 작성할 수있다.
	 
    - 정렬방식
        - ASC : 오름차순(ascending), 기본방식(생략가능)
        - DESC : 내림차순(descending)
		
문자열 오름차순 : 숫자 -> 대문자 -> 소문자 -> 한글 (유니코드 순서)
Date 오름차순 : 과거 -> 미래
null은 오름차순일 때 가장 먼저 나온다.

ex)
order by salary asc, emp_id desc
- salary로 전체 정렬을 하고 salary가 같은 행은 emp_id로 정렬.
******************************************************************* */

-- 총 결제금액(total_spent) 오름/내림 차순대로 조회하시오.


-- 이름(customer_name) 순서대로 조회하세요.


-- 가입 일자(created_at) 최신 순서대로 조회하세요.
