
/* **************************************************************************
서브쿼리(Sub Query)
- 쿼리안에서 select 쿼리를 사용하는 것.
- 메인 쿼리 - 서브쿼리

서브쿼리가 사용되는 구
 - select절, from절, where절, having절
 
서브쿼리의 종류
- 어느 구절에 사용되었는지에 따른 구분
    - 스칼라 서브쿼리 - select 절에 사용. 반드시 서브쿼리 결과가 1행 1열(값 하나-스칼라) 0행이 조회되면 null을 반환
    - 인라인 뷰 
        - from절에 서브쿼리를 사용하는 것.
        - 서브쿼리 결과를 테이블처럼 사용할 수 있다.
        - table alias(별칭)을 반드시 줘야 한다.
- 서브쿼리 조회결과 행수에 따른 구분
    - 단일행 서브쿼리 - 서브쿼리의 조회결과 행이 한행인 것.
    - 다중행 서브쿼리 - 서브쿼리의 조회결과 행이 여러 행인 것.
        - 비교 연산자로 '=' 대신 'in' 을 사용하고 크기 비교(>,>=, <, <=)에는 any나 all을 붙인다.
            - any : 서브쿼리 조회결과와 비교한 결과 중 하나만 참이면 참 (where 컬럼 > any(서브쿼리) )
	        - all : 서브쿼리 조회결과와 비교한 결과가 모두와 참이면 참 (where 컬럼 > all(서브쿼리) )
- 동작 방식에 따른 구분
    - 비상관 서브쿼리 - 서브쿼리에 메인쿼리의 컬럼이 사용되지 않는다.
                메인쿼리에 사용할 값을 서브쿼리가 제공하는 역할을 한다.
    - 상관 서브쿼리 - 서브쿼리에서 메인쿼리의 컬럼을 사용한다. 
                            메인쿼리가 먼저 수행되어 읽혀진 데이터를 서브쿼리에서 조건이 맞는지 확인하고자 할때 주로 사용한다.

- 서브쿼리는 반드시 ( ) 로 묶어줘야 한다.
************************************************************************** */

-- 가장 최근에 가입한 고객과 같은 가입일시(customer.created_at)를 가진 고객을 조회


-- 상품 평균 가격(product.price)보다 비싼 상품을 조회하시오


-- 전체 고객의 평균 총 구매액(customer.total_spent)보다 총 구매액이 큰 고객을 조회하시오.



-- 추천인이 있는 고객과 없는 고객간의 평균 총 결제금액(total_spent) 차이를 비교



-- 추천을 가장 많이 한 고객의 id와 이름을 조회.  공동 1등이 여러명일 때 다 다나오도록 조회한다.



-- 전체 주문의 평균 주문금액(orders.total_amount)보다 큰 주문을 한 고객의 정보를 조회하시오.


-- 최근 3개월 동안 주문한 고객 중에서 Gold 또는 VIP 등급 고객의 정보를 조회하시오.




/* **************************************************************************************
상관(연관) 쿼리
- 메인쿼리문 테이블의 값을 where절의 subquery에서 참조한다.
	- 메인 쿼리의 where실행에서 한 행씩 조회 대상인지 검사하면서 subquery가 실행되는데 이때 현재 검사중인 그 행의 컬럼값을 subquery가 사용한다.

- EXISTS, NOT EXISTS 연산자 (상관(연관)쿼리와 같이 사용된다)
    -- 서브쿼리의 결과를 만족하는 값이 존재하는지 여부를 확인하는 조건. 
    -- 조건을 만족하는 행이 여러개라도 한행만 있으면 더이상 검색하지 않는다.

    - 보통 데이터테이블의 값이 이력테이블(Transaction TB)에 있는지 여부를 조회할 때 사용된다.
        - 메인쿼리: 데이터테이블
        - 서브쿼리: 이력테이블
        - 메인쿼리에서 조회할 행이 서브쿼리의 테이블에 있는지(또는 없는지) 확인
        
    고객(데이터) 주문(이력) -> 특정 고객이 주문을 한 적이 있는지 여부
    장비(데이터) 대여(이력) -> 특정 장비가 대여 된 적이 있는지 여부
************************************************************************************* */
 

-- 고객(customer) 중 주문(orders)을 한번 이상 한 않은 고객들을 조회.


-- 고객(customer) 중 주문(orders)을 한번도 하지 않은 고객들을 조회.


--  제품(product) 중 한번 이상 주문된 제품 정보 조회


--  제품(product) 중 한번도 주문 안된 제품 정보 조회