/* *********************************************************************
UPDATE : 테이블의 컬럼의 값을 수정
UPDATE 테이블명
SET    변경할 컬럼 = 변경할 값  [, 변경할 컬럼 = 변경할 값]
[WHERE 제약조건]

 - UPDATE: 변경할 테이블 지정
 - SET: 변경할 컬럼과 값을 지정
 - WHERE: 변경할 행을 선택. 
************************************************************************ */

-- 고객 ID(customer_id)가 1인 고객의 total_spent를 5000으로 변경


-- 고객 ID(customer_id)가 1인 고객의 total_spent을 총 구매액(orders의 total_amount 합계)로 변경


-- 전체 고객의 적립 포인트(reward_point)를 두배 늘려준다.


-- 모든 적립 포인트(reward_point)를 total_spent의 1% 로 변경한다.



-- 고객 ID(customer_id)가 2인 고객의 직업(job)과 recommender_id를 null로 변경



/* *********************************************************************
DELETE : 테이블의 행을 삭제
구문 
 - DELETE FROM 테이블명 [WHERE 제약조건]
   - WHERE: 삭제할 행을 선택
************************************************************************ */

-- 주문 아이템 ID(order_item_id)가 1인 정보를 삭제.


-- 주문량이 1이고 총 가격(line_amount)가 50000 이하인 주문 아이템 삭제


-- 고객 ID가 1인 고객정보를 삭제한다. 